Revit 2024 API
BarTypeDiameterOptions Constructor
Overload List
Name | Description
BarTypeDiameterOptions()
 Constructs a new BarTypeDiameterOptions with default settings.
BarTypeDiameterOptions(RebarBarType)
 Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
See Also
BarTypeDiameterOptions Class
BarTypeDiameterOptions Members
Autodesk.Revit.DB Namespace